## Demo 01: Sakila Star Schema & ETL

In [1]:
pip install psycopg2-binary

Defaulting to user installation because normal site-packages is not writeable
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.3; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Program Files\Anaconda3\python.exe -m pip install --upgrade pip' command.

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.3-cp39-cp39-win_amd64.whl (1.2 MB)
     ---------------------------------------- 1.2/1.2 MB 592.6 kB/s eta 0:00:00
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.3

In [2]:
pip install ipython-sql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in c:\users\arqab raza\appdata\roaming\python\python39\site-packages (0.4.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\program files\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\arqab raza\appdata\roaming\python\python39\site-packages (from ipython-sql) (1.3.9)
Requirement already satisfied: prettytable<1 in c:\users\arqab raza\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\program files\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: sqlparse in c:\users\arqab raza\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: six in c:\program files\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: traitlets>=4.2 in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: colorama in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: pickleshare in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: jedi>=0.16 in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: matplotlib-inline in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: setuptools>=18.5 in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: backcall in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: pygments in c:\program files\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\program files\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\program files\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.3; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Program Files\Anaconda3\python.exe -m pip install --upgrade pip' command.

In [3]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\program files\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: pytz>=2017.3 in c:\program files\anaconda3\lib\site-packages (from pandas) (2021.3)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.3; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Program Files\Anaconda3\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: numpy>=1.17.3 in c:\program files\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\program files\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\program files\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

## Step0: Using ipython-sql

-- load pyhton sql using %load_ext sql

## Step1 : Connect to local database where Pagila is loaded

In [1]:
%load_ext sql

In [2]:
# connection
conn_string = "postgresql://postgres:707707@localhost:5432/pagila"
print(conn_string)

postgresql://postgres:707707@localhost:5432/pagila

In [3]:
%sql $conn_string

In [4]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;




print("nStores\t\t=", nStores[0][0])
print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nCity\t\t=", nCity[0][0])
print("nCountry\t=", nCountry[0][0])

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
nStores		= 2
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nCity		= 600
nCountry	= 109

## When? What time period are we talking about?

In [5]:
%%sql
select min(rental_date) as start, max(rental_date) as end from rental;

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.

[(datetime.datetime(2005, 5, 24, 22, 53, 30), datetime.datetime(2006, 2, 14, 15, 16, 3))]

## Where ? Where do events in this database occur?

In [6]:
%%sql
select district, sum(city_id) as n
from address
group by district
order by n desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790)]

## Step3: Perform some simple Data Analysis

## 3.1.1 Films

In [7]:
%%sql
select film_id, title, release_year, rental_rate, rating from film limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

## 3.1.2 Payments

In [16]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577)),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577)),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577)),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577)),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577))]

## 3.1.3 Inventory

In [17]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 10, 9, 17))]

## 3.1.4 Get the movie of every Payment

In [13]:
%%sql
Select f.title, p.amount, p.payment_date, p.customer_id
from film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON ( r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577), 269)]

## 3.1.5 sum movie rental revenue

In [15]:
%%sql
Select f.title, sum(p.amount) as revenue
from film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON ( r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
GROUP BY title
ORDER BY revenue desc
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72'))]

## Insight 2: Top Grossing Cities

'Payment amount are in the table payment'
'Cities are in table cities'
'Payment --> customer --> address --> city'

## 3.2.1 Get the city of each payment

In [22]:
%%sql
Select p.customer_id, p.rental_id, p.amount, c.city
from payment p
JOIN customer cus ON (p.customer_id = cus.customer_id)
JOIN address a ON (a.address_id = cus.address_id)
JOIN city c ON (c.city_id = a.city_id)
order by p.payment_date
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

## 3.2.2 Top grossing cities

In [24]:
%%sql
Select c.city, sum(p.amount) as revenue
from payment p
JOIN customer cus ON (p.customer_id = cus.customer_id)
JOIN address a ON (a.address_id = cus.address_id)
JOIN city c ON (c.city_id = a.city_id)
GROUP BY city
order by revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

## 3.3 Insight 3: Revenue of a movie by customer city and by month

## 3.3.1 Totak revenue by month

In [25]:
%%sql
Select sum(p.amount) as revenue, EXTRACT(month from p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 1

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(Decimal('28559.46'), Decimal('4')),
 (Decimal('23886.56'), Decimal('3')),
 (Decimal('9631.88'), Decimal('2')),
 (Decimal('4824.43'), Decimal('1')),
 (Decimal('514.18'), Decimal('5'))]

## 3.3.2 Each movie by customer city and by month (data cube)

In [27]:
%%sql
Select f.title, p.amount, p.customer_id, ci.city, p.payment_date, EXTRACT(month from p.payment_date) as month
FROM film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON (r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
JOIN customer c ON (c.customer_id = p.customer_id)
JOIN address a ON (a.address_id = c.address_id)
JOIN city ci ON (ci.city_id = a.city_id)
order by p.payment_date
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2007, 1, 24, 21, 21, 56, 996577), Decimal('1')),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2007, 1, 24, 21, 22, 59, 996577), Decimal('1')),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2007, 1, 24, 21, 32, 5, 996577), Decimal('1')),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2007, 1, 24, 21, 33, 7, 996577), Decimal('1')),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2007, 1, 24, 21, 33, 47, 996577), Decimal('1')),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2007, 1, 24, 21, 36, 33, 996577), Decimal('1')),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), Decimal('1')),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2007, 1, 24, 22, 0, 12, 996577), Decimal('1')),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2007, 1, 24, 22, 29, 6, 996577), Decimal('1')),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2007, 1, 24, 22, 30, 47, 996577), Decimal('1'))]

## 3.3.3 Sum of revenue of each movie by customer city and by month

In [29]:
%%sql
Select f.title, sum(p.amount) as revenue, ci.city, EXTRACT(month from p.payment_date) as month
FROM film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON (r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
JOIN customer c ON (c.customer_id = p.customer_id)
JOIN address a ON (a.address_id = c.address_id)
JOIN city ci ON (ci.city_id = a.city_id)
GROUP BY (f.title, month, ci.city)
order by month
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('ACADEMY DINOSAUR', Decimal('0.99'), 'Celaya', Decimal('1')),
 ('ACADEMY DINOSAUR', Decimal('1.99'), 'Cianjur', Decimal('1')),
 ('ADAPTATION HOLES', Decimal('2.99'), 'Shikarpur', Decimal('1')),
 ('AFFAIR PREJUDICE', Decimal('3.99'), 'Hidalgo', Decimal('1')),
 ('AFFAIR PREJUDICE', Decimal('3.99'), 'Tuguegarao', Decimal('1')),
 ('AFRICAN EGG', Decimal('3.99'), 'Ivanovo', Decimal('1')),
 ('AGENT TRUMAN', Decimal('8.99'), 'Coatzacoalcos', Decimal('1')),
 ('AGENT TRUMAN', Decimal('5.99'), 'Izumisano', Decimal('1')),
 ('AIRPORT POLLOCK', Decimal('5.99'), 'Okinawa', Decimal('1')),
 ('AIRPORT POLLOCK', Decimal('4.99'), 'Pemalang', Decimal('1'))]